%3х мерна€ графика
%ax+by+cz+d=0 поаерхность 1 пор€дка
%ax^2+by+cz+d=0 поверхность 2 пор€дка
%x^2/a^2+y^2/b^2+z^2/c^2=d^2 - элипсойд a b c отвечают за сжатость элипса
% (книга по линалу)парабалойд - z-z0=((x-x0)^2)/a^2+((y-y0)^2)/b^2
%x-x0- сдвиг фигуры относитьено начала координат
% a b сжатие в определннных направлени€х
x0=4;
y0=3;
z0=8;
a=2;
b=2;
A=2;
B=5;
C=2;
D=-500;
%1) разбить оси на точки
x=-50:5:50;
y=-50:5:50;
[X, Y]=meshgrid(x,y);% создание сетки
Z=z0+(X-x0).^2./a^2+(Y-y0).^2./b^2;
[Xp,Yp]=meshgrid(-50:5:50,-50:5:50);
Zp=(-A.*Xp-B.*Yp-D)./C;
figure 
grid on
  hold on
 mesh(X,Y,Z)
 surf(Xp,Yp,Zp)


% figure 
% hold on
% grid on
% colormap('summer')
% subplot(2,2,1)% строки, столбцы, номер €чейки
% 
% surf(X,Y,Z)%строит поверхность  с заливкой
% subplot(2,2,2)
% mesh(X,Y,Z)%строит поверхность как каркас
% subplot(2,2,3)
% surfl(X,Y,Z)
% shading interp%  убирает решетку
% subplot(2,2,4)
% surf(X,Y,Z)

