% %1.
% x=1;
% y=MyFunc(x)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%555
% %2.
% x=-10:0.1:10;%шаг для масива 
% y=MyFunc(x)%функция лежат в одной папке со скриптом
% 
% figure
% hold on
% grid on
% plot(x,y)
% axis([0,4,-inf,inf])% показать определенный промежуток от функции
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%555
% %3.
% %определить корни fzero
% x=-10:0.1:10;%шаг для масива 
% y=MyFunc(x);%функция лежат в одной папке со скриптом
% x_r=fzero('MyFunc',1.5);%ищем корень
% y_r=MyFunc(x_r)
% 
% figure
% hold on
% grid on
% plot(x,y)
% % plot(x_r,y_r)
% plot(x_r,0,'h')%(ч-точки,н-точки, маркер)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%55
%  4. экстренум функции fminbnd
% x=-10:0.1:10;%шаг для масива 
% y=MyFunc(x);%функция лежат в одной папке со скриптом
% % axis([0,4,-inf,inf])% показать определенный промежуток от функции
% x_min=fminbnd('MyFunc',1,2)
% y_min=MyFunc(x_min)
% 
% figure
% hold on 
% grid
% plot(x,y)
% plot(x_min,y_min,'d')
% 
% min=fminbnd ('MyFunc',0,4)
% max=fminbnd('MyFunc_',0,4)
% % c=max()
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%5
% %5. diff дифференцируем функцию

x=-10:0.01:10;%шаг для масива 
y=MyFunc(x);%функция лежат в одной папке со скриптом
% axis([0,4,-inf,inf])% показать определенный промежуток от функции
y_diff=diff(y);

figure
hold on 
grid on
% subplot(1,2,2)
plot(x,y)
% subplot(1,2,2)
plot(x(1:2000),y_diff)%задам промежуток у масива
